roblatour/ESP32TimeServer/main/main.cpp
// ESP32 Time Server v2.3.1
// Copyright Rob Latour, 2026

//
// ESP32 Dev Board:     ESP32-P4-ETH https://www.waveshare.com/esp32-p4-eth.htm
//                                   https://www.waveshare.com/wiki/ESP32-P4-ETH?srsltid=AfmBOoo6nZm5hsPAhtpzT6lWSHd2zhWNPM_mqgbNvyoESbjvbO7uykcH
//
//                      NOTE: Powering the ESP32-P4_ETH by either a USB C cable or, with its optional POE had installed,
//                      a POE Ethernet cable is sufficient to power the ESP32-P4-ETH, GPS module and LCD screen.
//
//                      ************************************************************************************************
//                      * HOWEVER DO NOT POWER THE ESP32-P4_ETH VIA BOTH ITS USB C CONNECTION AND POE AT THE SAME TIME *
//                      ************************************************************************************************
//
// GPS (recommended):   SparkFun GNSS Receiver Breakout - MAX-M10S  https://www.sparkfun.com/sparkfun-gnss-receiver-breakout-max-m10s-qwiic.html
//
// LCD2004:             blue/green screen with HD44780 I2C serial interface adapter https://www.aliexpress.com/item/1005006829045609.html.
//
// Wiring:
//
// (mandatory) GPS module wiring to and from the ESP32-P4-ETH board:
// GPS GND            <- -> ESP32-P4-ETH GND
// GPS VCC            <- -> ESP32-P4-ETH 3V3
// GPS TXD            <- -> ESP32-P4-ETH GPIO17 (RX)
// GPS RXD            <- -> ESP32-P4-ETH GPIO16 (TX)
// GPS PPS            <- -> ESP32-P4-ETH GPIO18
//
// (optional) LCD204A V1.5 (HD44780 + PCF8574T I2C backpack) wiring to and from the ESP32-P4-ETH board:
// LCD GND            <- -> ESP32-P4-ETH GND
// LCD VCC            <- -> ESP32-P4-ETH 3V3
// LCD SDA            <- -> ESP32-P4-ETH GPIO8 (SDA)
// LCD SLC/SCL        <- -> ESP32-P4-ETH GPIO7 (SCL)
//
// (optional) Up time momentary button to and from teh ESP32-P4-ETH board:
// one terminal       <- -> ESP32-P4-ETH GPI03
// the other terminal <- -> ESP32-P4-ETH GND

#include <atomic>
#include <cerrno>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <ctime>
#include <sys/time.h>
#include <vector>

#include "Arduino.h"
#include "ArduinoOTA.h"
#include "ETH.h"
#include "SparkFun_u-blox_GNSS_v3.h"
#include "ESP32TimeServerSettings.h"

extern "C"
{
#include "esp_event.h"
#include "esp_log.h"
#include "esp_mac.h"
#include "esp_netif.h"
#include "esp_timer.h"
#include "nvs.h"
#include "nvs_flash.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "freertos/queue.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "hd44780.h"
#include "lwip/inet.h"
#include "lwip/sockets.h"
#include "pcf8574.h"
}

static constexpr gpio_num_t ETH_MDC_GPIO = GPIO_NUM_31;
static constexpr gpio_num_t ETH_MDIO_GPIO = GPIO_NUM_52;
static constexpr gpio_num_t ETH_PHY_RST_GPIO = GPIO_NUM_51;
static constexpr int ETH_PHY_ADDRESS = 1;

static constexpr i2c_port_t LCD_I2C_PORT = I2C_NUM_0;
static constexpr gpio_num_t LCD_I2C_SDA_GPIO = GPIO_NUM_8;
static constexpr gpio_num_t LCD_I2C_SCL_GPIO = GPIO_NUM_7;

static constexpr uint16_t NTP_PORT = 123;
static constexpr size_t NTP_PACKET_SIZE = 48;
static constexpr uint64_t NTP_EPOCH_OFFSET = 2208988800ULL;
static constexpr EventBits_t ETH_CONNECTED_BIT = BIT0;
static constexpr EventBits_t ETH_GOT_IP_BIT = BIT1;
static constexpr uint32_t OTA_Failure_Display_Time_Ms = 10000;
static constexpr uint32_t OTA_Reboot_Delay_Ms = 5000;

static const char *TAG = "main_cpp";

static i2c_dev_t s_lcd_io{};
static uint8_t s_lcd_addr = 0;
static bool s_lcd_ready = false;
static hd44780_t s_lcd{};
static char s_lcd_last_lines[lcdRows][lcdColumns + 1] = {};
static bool s_lcd_line_cached[lcdRows] = {};

static EventGroupHandle_t s_net_event_group = nullptr;
static SemaphoreHandle_t s_time_mutex = nullptr;
static SemaphoreHandle_t s_pps_semaphore = nullptr;
static QueueHandle_t s_pps_timestamp_queue = nullptr;
static SemaphoreHandle_t s_ota_mutex = nullptr;
static SemaphoreHandle_t s_lcd_mutex = nullptr;
static SemaphoreHandle_t s_sync_state_mutex = nullptr;

static bool s_ota_in_progress = false;
static bool s_ota_failed = false;
static bool s_ota_success = false;
static int s_ota_progress_percent = -1;
static int64_t s_ota_failure_display_until_us = 0;
static int64_t s_ota_reboot_at_us = 0;
static char s_ota_error_reason[lcdColumns + 1] = "";

static std::atomic<bool> s_safe_guard_tripped{false};
static std::atomic<bool> s_time_setting_in_progress{false};
static std::atomic<bool> s_time_has_been_set{false};
static uint64_t s_ntp_reference_time_64 = 0;
static bool s_ntp_reference_valid = false;

static char s_ip_address[16] = "";

static HardwareSerial s_gps_serial(1);
static SFE_UBLOX_GNSS_SERIAL s_gps;
static uint32_t s_detected_gps_baud = 0;
static bool s_gps_required_assume_success = false;

// The following flag for National Marine Electronics Association fallback doesn't determine if it is allowed or not
// rather the program sets it to true if it is required (due to an older / ubox uncompliant hardware gps module being used)

static bool s_use_nmea_fallback = false;
static std::atomic<bool> s_pps_discipline_active{false};

enum class sync_fault_t : uint8_t
{
    none = 0,
    pps_missing,
    gps_invalid,
    sanity_mismatch,
    sync_stale
};

struct sync_state_t
{
    int64_t last_successful_sync_us = 0;
    int64_t last_sync_attempt_us = 0;
    int64_t last_pps_seen_us = 0;
    time_t last_sync_delta_seconds = 0;
    uint32_t consecutive_sync_failures = 0;
    uint32_t consecutive_sanity_failures = 0;
    bool holdover_mode = false;
    bool pps_active = false;
    sync_fault_t fault = sync_fault_t::none;
};

struct sync_candidate_t
{
    time_t candidate_time = 0;
    bool use_pps_alignment = false;
    bool used_nmea_fallback = false;
    int64_t pps_release_time_us = 0;
    sync_fault_t failure = sync_fault_t::none;
};

static sync_state_t s_sync_state{};
static constexpr int64_t Sync_Stale_After_Us = static_cast<int64_t>(periodicGPSRefreshEveryThisNumberOfMinutes) * 60LL * 1000000LL * 3LL;
static constexpr int64_t Sync_Reboot_After_Us = 30LL * 60LL * 1000000LL;
static constexpr int64_t Max_Sync_Attempt_Us = 10000000LL;
static constexpr uint32_t Sync_Failures_Before_Runtime_Recovery = 3;
static constexpr uint32_t Sanity_Failures_Before_Fault = 2;

static constexpr char GPS_NVS_NAMESPACE[] = "gps_state";
static constexpr char GPS_NVS_KEY_ID_TYPE[] = "id_type";
static constexpr char GPS_NVS_KEY_ID_VALUE[] = "id_value";
static constexpr char GPS_NVS_KEY_MAX_BAUD[] = "max_baud";
static constexpr char GPS_NVS_KEY_ATTEMPT_NO_SIGNAL_RECOVERY[] = "no_sig_rcv";

static constexpr char GPS_ID_TYPE_UNIQID[] = "uniqid";
static constexpr char GPS_ID_TYPE_MODULE_FP[] = "module_fp";
static constexpr char GPS_ID_TYPE_GENERIC[] = "generic";
static constexpr char GPS_ID_VALUE_UNDETERMINED[] = "undetermined_gps_board";

struct gps_identity_t
{
    bool valid = false;
    char type[16] = "";
    char value[96] = "";
};

struct gps_nvs_data_t
{
    bool has_id_type = false;
    char id_type[16] = "";
    char id_value[96] = "";
    uint32_t max_baud = 0;
    bool has_attempt_no_signal_recovery = false;
    bool attempt_no_signal_recovery = true;
};

