roblatour/ESP32TimeServer/main/main.cpp
    (void)nvs_get_u32(handle, GPS_NVS_KEY_MAX_BAUD, &data->max_baud);

    uint8_t attempt_no_signal_recovery = 0;
    err = nvs_get_u8(handle, GPS_NVS_KEY_ATTEMPT_NO_SIGNAL_RECOVERY, &attempt_no_signal_recovery);
    if (err == ESP_OK)
    {
        data->has_attempt_no_signal_recovery = true;
        data->attempt_no_signal_recovery = attempt_no_signal_recovery != 0;
    }

    nvs_close(handle);
    return true;
}

static bool save_gps_nvs_data(const gps_identity_t &identity, uint32_t max_baud)
{
    if (!identity.valid || identity.type[0] == '\0' || identity.value[0] == '\0' || max_baud == 0)
        return false;

    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(GPS_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK)
        return false;

    err = nvs_set_str(handle, GPS_NVS_KEY_ID_TYPE, identity.type);
    if (err == ESP_OK)
        err = nvs_set_str(handle, GPS_NVS_KEY_ID_VALUE, identity.value);
    if (err == ESP_OK)
        err = nvs_set_u32(handle, GPS_NVS_KEY_MAX_BAUD, max_baud);
    if (err == ESP_OK)
        err = nvs_commit(handle);

    nvs_close(handle);
    return err == ESP_OK;
}

static bool save_attempt_no_signal_recovery_setting(bool enabled)
{
    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(GPS_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK)
        return false;

    err = nvs_set_u8(handle, GPS_NVS_KEY_ATTEMPT_NO_SIGNAL_RECOVERY, enabled ? 1U : 0U);
    if (err == ESP_OK)
        err = nvs_commit(handle);

    nvs_close(handle);
    return err == ESP_OK;
}

static bool resolve_initial_attempt_no_signal_recovery(const gps_nvs_data_t &stored)
{
    if (stored.has_attempt_no_signal_recovery)
        return stored.attempt_no_signal_recovery;

    return !stored.has_id_type;
}

static void clear_gps_nvs_data()
{
    nvs_handle_t handle = 0;
    esp_err_t err = nvs_open(GPS_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK)
        return;

    err = nvs_erase_key(handle, GPS_NVS_KEY_ID_TYPE);
    if (err != ESP_OK && err != ESP_ERR_NVS_NOT_FOUND)
    {
        nvs_close(handle);
        return;
    }

    err = nvs_erase_key(handle, GPS_NVS_KEY_ID_VALUE);
    if (err != ESP_OK && err != ESP_ERR_NVS_NOT_FOUND)
    {
        nvs_close(handle);
        return;
    }

    err = nvs_erase_key(handle, GPS_NVS_KEY_MAX_BAUD);
    if (err != ESP_OK && err != ESP_ERR_NVS_NOT_FOUND)
    {
        nvs_close(handle);
        return;
    }

    err = nvs_erase_key(handle, GPS_NVS_KEY_ATTEMPT_NO_SIGNAL_RECOVERY);
    if (err != ESP_OK && err != ESP_ERR_NVS_NOT_FOUND)
    {
        nvs_close(handle);
        return;
    }

    (void)nvs_commit(handle);
    nvs_close(handle);
}

static gps_identity_t query_gps_identity()
{
    gps_identity_t identity{};

    UBX_SEC_UNIQID_data_t unique_chip_data{};
    if (s_gps.getUniqueChipId(&unique_chip_data, 2000))
    {
        const char *unique_chip_id = s_gps.getUniqueChipIdStr(&unique_chip_data, 2000);
        if (unique_chip_id != nullptr && unique_chip_id[0] != '\0')
        {
            snprintf(identity.type, sizeof(identity.type), "%s", GPS_ID_TYPE_UNIQID);
            snprintf(identity.value, sizeof(identity.value), "%s", unique_chip_id);
            identity.valid = true;
            return identity;
        }
    }

    if (s_gps.getModuleInfo(2000))
    {
        const char *module_name = s_gps.getModuleName(2000);
        const char *firmware_type = s_gps.getFirmwareType(2000);
        uint8_t firmware_high = s_gps.getFirmwareVersionHigh(2000);
        uint8_t firmware_low = s_gps.getFirmwareVersionLow(2000);
        uint8_t protocol_high = s_gps.getProtocolVersionHigh(2000);
        uint8_t protocol_low = s_gps.getProtocolVersionLow(2000);

        if (module_name != nullptr && module_name[0] != '\0')
        {
            snprintf(identity.type, sizeof(identity.type), "%s", GPS_ID_TYPE_MODULE_FP);
            snprintf(identity.value,
                     sizeof(identity.value),
                     "%s|%s|FW%u.%u|PR%u.%u",
                     module_name,
                     firmware_type == nullptr ? "" : firmware_type,
                     static_cast<unsigned int>(firmware_high),
                     static_cast<unsigned int>(firmware_low),
                     static_cast<unsigned int>(protocol_high),
                     static_cast<unsigned int>(protocol_low));
            identity.valid = true;
            return identity;
        }
    }

    snprintf(identity.type, sizeof(identity.type), "%s", GPS_ID_TYPE_GENERIC);
    snprintf(identity.value, sizeof(identity.value), "%s", GPS_ID_VALUE_UNDETERMINED);
    identity.valid = true;
    return identity;
}

static bool gps_identity_matches(const gps_nvs_data_t &stored, const gps_identity_t &current)
{
    if (!stored.has_id_type || !current.valid)
        return false;

    return strcmp(stored.id_type, current.type) == 0 && strcmp(stored.id_value, current.value) == 0;
}

static bool check_uptime_request()
{

    if (!supportForAnUpTimeRestartButton)
        return false;

    static bool button_was_pressed = false;
    static uint32_t button_press_start_ms = 0;

    bool button_pressed = gpio_get_level(static_cast<gpio_num_t>(upTimeRestartPin)) == 0;

    if (button_pressed)
    {
        vTaskDelay(pdMS_TO_TICKS(10));
        button_pressed = gpio_get_level(static_cast<gpio_num_t>(upTimeRestartPin)) == 0;
    }

    if (!button_pressed)
    {
        button_was_pressed = false;
        button_press_start_ms = 0;
        return false;
    }

    if (!button_was_pressed)
    {
        button_was_pressed = true;
        button_press_start_ms = millis();
    }
    else if (millis() - button_press_start_ms >= holdUpTimeRestartButtonForThisManySecondsToTriggerAReset * 1000UL)
    {
        clear_gps_nvs_data();
        if (debugIsOn)
            ESP_LOGI(TAG, "Up time/reset button restart requested: cleared stored GPS NVS values.");
        esp_restart();
    }

    return true;
}

static int64_t days_from_civil(int year, unsigned month, unsigned day)
{
    year -= month <= 2;
    const int era = (year >= 0 ? year : year - 399) / 400;
    const unsigned yoe = static_cast<unsigned>(year - era * 400);
    const unsigned doy = (153U * (month + (month > 2 ? static_cast<unsigned>(-3) : 9U)) + 2U) / 5U + day - 1U;
    const unsigned doe = yoe * 365U + yoe / 4U - yoe / 100U + doy;
    return static_cast<int64_t>(era) * 146097LL + static_cast<int64_t>(doe) - 719468LL;
}

static time_t epoch_from_utc(int year, int month, int day, int hour, int minute, int second)
{
    int64_t days = days_from_civil(year, static_cast<unsigned>(month), static_cast<unsigned>(day));
    int64_t seconds = days * 86400LL + hour * 3600LL + minute * 60LL + second;
    return static_cast<time_t>(seconds);
}

static uint64_t get_current_time_in_ntp64_format()
{
    struct timeval now{};
    gettimeofday(&now, nullptr);

    uint64_t seconds = NTP_EPOCH_OFFSET + static_cast<uint64_t>(now.tv_sec);
    uint64_t fraction = static_cast<uint64_t>(static_cast<double>(now.tv_usec) * 4294.967296);
    return (seconds << 32) | (fraction & 0xFFFFFFFFULL);
}

static void write_ntp_timestamp(uint8_t *reply, size_t offset, uint64_t timestamp)
{
    reply[offset + 0] = static_cast<uint8_t>((timestamp >> 56) & 0xFF);
    reply[offset + 1] = static_cast<uint8_t>((timestamp >> 48) & 0xFF);
    reply[offset + 2] = static_cast<uint8_t>((timestamp >> 40) & 0xFF);
    reply[offset + 3] = static_cast<uint8_t>((timestamp >> 32) & 0xFF);
    reply[offset + 4] = static_cast<uint8_t>((timestamp >> 24) & 0xFF);
    reply[offset + 5] = static_cast<uint8_t>((timestamp >> 16) & 0xFF);
    reply[offset + 6] = static_cast<uint8_t>((timestamp >> 8) & 0xFF);
    reply[offset + 7] = static_cast<uint8_t>(timestamp & 0xFF);
}

static void build_ntp_reply(const uint8_t *request, uint8_t *reply, uint64_t receive_time, uint64_t transmit_time)
{
    memset(reply, 0, NTP_PACKET_SIZE);

    reply[0] = 0b00011100;
    reply[1] = 0b00000001;
    reply[2] = 4;
    reply[3] = 0xF7;
    reply[11] = 0x50;
    reply[12] = 'G';
    reply[13] = 'P';
    reply[14] = 'S';

    uint64_t reference_time = s_ntp_reference_valid ? s_ntp_reference_time_64 : receive_time;
    write_ntp_timestamp(reply, 16, reference_time);

    memcpy(reply + 24, request + 40, 8);

