roblatour/ESP32TimeServer/main/main.cpp
static bool try_gps_begin(uint32_t baud, bool assume_success, bool *saw_serial_data)
{

    static constexpr uint16_t gpsBeginMaxWaitMs = 2500;

    gps_probe_result_t probe_result = probe_gps_uart(baud);
    if (probe_result.saw_data && saw_serial_data != nullptr)
        *saw_serial_data = true;

    if (debugIsOn)
        ESP_LOGI(TAG,
                 "GPS probe at %lu baud: %u bytes seen, sample: %s",
                 static_cast<unsigned long>(baud),
                 static_cast<unsigned int>(probe_result.bytes_seen),
                 probe_result.saw_data ? probe_result.sample : "<none>");

    s_gps_serial.end();
    s_gps_serial.begin(baud, SERIAL_8N1, RXPin, TXPin);
    vTaskDelay(pdMS_TO_TICKS(150));

    bool begin_result = s_gps.begin(s_gps_serial, gpsBeginMaxWaitMs, assume_success);
    if (debugIsOn)
        ESP_LOGI(TAG,
                 "GPS begin at %lu baud with assume_success=%s -> %s",
                 static_cast<unsigned long>(baud),
                 assume_success ? "true" : "false",
                 begin_result ? "success" : "failed");

    return begin_result;
}

static bool set_gps_baud_rate(uint32_t gps_baud, int max_attempts, uint32_t initial_probe_baud = 0)
{

    std::vector<uint32_t> candidate_baud_rates;
    uint32_t preferred_probe_baud = initial_probe_baud > 0 ? initial_probe_baud : gps_baud;
    build_candidate_baud_rates(candidate_baud_rates, preferred_probe_baud);

    bool saw_any_serial_data = false;
    s_detected_gps_baud = 0;
    s_gps_required_assume_success = false;

    char baud_line[lcdColumns + 1];

    for (int attempt = 0; attempt < max_attempts; ++attempt)
    {
        if (debugIsOn)
            ESP_LOGI(TAG, "GPS initialization attempt %d of %d", attempt + 1, max_attempts);

        for (uint32_t candidate_baud : candidate_baud_rates)
        {

            char dots[10] = "";
            for (int i = 0; i < (attempt % 4); i++)
                strcat(dots, ".");

            snprintf(baud_line, sizeof(baud_line), "Baud: %lu %s", static_cast<unsigned long>(candidate_baud), dots);
            display_line(2, baud_line);

            bool begin_without_assume = try_gps_begin(candidate_baud, false, &saw_any_serial_data);
            bool begin_with_assume = false;
            if (!begin_without_assume)
                begin_with_assume = try_gps_begin(candidate_baud, true, &saw_any_serial_data);

            if (begin_without_assume || begin_with_assume)
            {
                s_detected_gps_baud = candidate_baud;
                s_gps_required_assume_success = begin_with_assume;

                if (candidate_baud != gps_baud)
                {
                    if (debugIsOn)
                        ESP_LOGI(TAG,
                                 "GPS responded at %lu baud. Attempting to switch to %lu baud.",
                                 static_cast<unsigned long>(candidate_baud),
                                 static_cast<unsigned long>(gps_baud));

                    bool baud_change_command_reported_success = s_gps.setSerialRate(gps_baud);
                    if (!baud_change_command_reported_success && debugIsOn)
                        ESP_LOGW(TAG, "GPS baud-rate change command to %lu was not acknowledged. Probing the target baud anyway.", static_cast<unsigned long>(gps_baud));

                    vTaskDelay(pdMS_TO_TICKS(200));

                    bool reconnect_without_assume = try_gps_begin(gps_baud, false, &saw_any_serial_data);
                    bool reconnect_with_assume = false;
                    if (!reconnect_without_assume)
                        reconnect_with_assume = try_gps_begin(gps_baud, true, &saw_any_serial_data);

                    if (reconnect_without_assume || reconnect_with_assume)
                    {
                        s_detected_gps_baud = gps_baud;
                        s_gps_required_assume_success = reconnect_with_assume;

                        if (!baud_change_command_reported_success && debugIsOn)
                            ESP_LOGW(TAG, "GPS baud-rate change command to %lu reported failure, but reconnect succeeded at the new baud.", static_cast<unsigned long>(gps_baud));
                    }
                    else
                    {
                        bool old_baud_without_assume = try_gps_begin(candidate_baud, false, &saw_any_serial_data);
                        bool old_baud_with_assume = false;
                        if (!old_baud_without_assume)
                            old_baud_with_assume = try_gps_begin(candidate_baud, true, &saw_any_serial_data);

                        if (old_baud_without_assume || old_baud_with_assume)
                        {
                            s_detected_gps_baud = candidate_baud;
                            s_gps_required_assume_success = old_baud_with_assume;

                            if (baud_change_command_reported_success && rebootIfGpsBaudChangeCommandSucceedsButImmediateReconnectFails)
                            {
                                if (debugIsOn)
                                    ESP_LOGW(TAG, "GPS baud-rate change command to %lu was acknowledged, but immediate reconnect failed. Rebooting to complete transition.", static_cast<unsigned long>(gps_baud));
                                display_line(1, "GPS baud changed");
                                display_line(2, "Rebooting...");
                                vTaskDelay(pdMS_TO_TICKS(1000));
                                esp_restart();
                            }

                            if (debugIsOn)
                                ESP_LOGW(TAG, "GPS baud-rate change to %lu did not take effect immediately. Continuing at detected baud %lu.", static_cast<unsigned long>(gps_baud), static_cast<unsigned long>(candidate_baud));
                        }
                        else
                        {
                            if (debugIsOn)
                                ESP_LOGW(TAG, "GPS baud-rate change attempt left module unreachable at both %lu and %lu. Continuing with best-known state.", static_cast<unsigned long>(candidate_baud), static_cast<unsigned long>(gps_baud));
                        }
                    }
                }

                if (s_gps_required_assume_success)
                {
                    if (debugIsOn)
                        ESP_LOGW(TAG,
                                 "GPS communication was established only with assume_success=true at %lu baud. The attached module may have limited u-blox compatibility.",
                                 static_cast<unsigned long>(s_detected_gps_baud));
                }

