roblatour/ESP32TimeServer/main/main.cpp
                if (debugIsOn)
                    ESP_LOGI(TAG, "GPS initialization will continue at %lu baud.", static_cast<unsigned long>(s_detected_gps_baud));
                return true;
            }
        }

        vTaskDelay(pdMS_TO_TICKS(2000));
    }

    if (saw_any_serial_data)
    {
        if (debugIsOn)
            ESP_LOGW(TAG, "GPS serial data was detected, but SparkFun u-blox GNSS v3 could not initialize the module. The module may be an older NEO-6/7/M8 variant.");
    }
    else
    {
        if (debugIsOn)
            ESP_LOGW(TAG, "No GPS serial data was detected on GPIO%d/GPIO%d at any tested baud rate. Check power, TX/RX wiring, and signal levels.", RXPin, TXPin);
    }

    return false;
}

static bool configure_gps_outputs(bool *uart1_output_set_result)
{
    bool i2c_output_disabled = s_gps.setI2COutput(0);
    bool uart1_output_set = s_gps.setUART1Output(COM_TYPE_UBX | COM_TYPE_NMEA);
    bool uart2_output_disabled = s_gps.setUART2Output(0);

    if (uart1_output_set_result != nullptr)
        *uart1_output_set_result = uart1_output_set;

    if (debugIsOn)
        ESP_LOGI(TAG,
                 "GPS port config results: I2C off=%s, UART1 UBX=%s, UART2 off=%s",
                 i2c_output_disabled ? "ok" : "failed",
                 uart1_output_set ? "ok" : "failed",
                 uart2_output_disabled ? "ok" : "failed");

    if (debugIsOn && !uart2_output_disabled)
        ESP_LOGI(TAG, "UART2 output disable is not supported by this module/firmware. Continuing with UART1 configuration.");

    if (debugIsOn && !i2c_output_disabled)
        ESP_LOGI(TAG, "I2C output disable did not succeed. This is non-fatal for UART1 operation.");

    return uart1_output_set;
}

static bool perform_extended_no_signal_recovery()
{
    if (debugIsOn)
        ESP_LOGW(TAG, "Performing GPS extended no-signal recovery: factory-default + GNSS reset + reinitialization.");

    bool factory_default_applied = s_gps.factoryDefault();
    if (debugIsOn)
        ESP_LOGI(TAG, "GPS factoryDefault() -> %s", factory_default_applied ? "ok" : "failed");

    s_gps.hardReset();
    vTaskDelay(pdMS_TO_TICKS(1500));

    static constexpr int recoveryInitAttempts = 3;
    uint32_t recovery_target_baud = s_gps_target_baud > 0 ? s_gps_target_baud : get_highest_candidate_gps_baud();
    if (!set_gps_baud_rate(recovery_target_baud, recoveryInitAttempts))
    {
        if (debugIsOn)
            ESP_LOGW(TAG, "GPS recovery reinitialization failed after reset.");
        return false;
    }

    bool uart1_output_set = false;
    bool gps_outputs_configured = configure_gps_outputs(&uart1_output_set);
    s_use_nmea_fallback = s_gps_required_assume_success || !uart1_output_set;

    if (debugIsOn)
        ESP_LOGI(TAG, "GPS recovery post-config: outputs=%s, fallback=%s, baud=%lu",
                 gps_outputs_configured ? "ok" : "partial",
                 s_use_nmea_fallback ? "enabled" : "disabled",
                 static_cast<unsigned long>(s_detected_gps_baud));

    return true;
}

static void halt_with_display(const char *line1, const char *line2, const char *line3)
{
    display_line(1, line1);
    display_line(2, line2);
    display_line(3, line3);
    while (true)
        vTaskDelay(pdMS_TO_TICKS(1000));
}

static void IRAM_ATTR pps_isr_handler(void *arg)
{
    int64_t edge_us = esp_timer_get_time();
    BaseType_t higher_priority_task_woken = pdFALSE;
    if (s_pps_semaphore != nullptr)
        xSemaphoreGiveFromISR(s_pps_semaphore, &higher_priority_task_woken);
    if (s_pps_timestamp_queue != nullptr)
        xQueueOverwriteFromISR(s_pps_timestamp_queue, &edge_us, &higher_priority_task_woken);
    if (higher_priority_task_woken == pdTRUE)
        portYIELD_FROM_ISR();
}

static void setup_pps_input()
{
    gpio_config_t config{};
    config.pin_bit_mask = 1ULL << PPSPin;
    config.mode = GPIO_MODE_INPUT;
    config.pull_up_en = GPIO_PULLUP_DISABLE;
    config.pull_down_en = GPIO_PULLDOWN_ENABLE;
    config.intr_type = GPIO_INTR_POSEDGE;
    ESP_ERROR_CHECK(gpio_config(&config));

    esp_err_t err = gpio_install_isr_service(0);
    if (err != ESP_OK && err != ESP_ERR_INVALID_STATE)
        ESP_ERROR_CHECK(err);

    ESP_ERROR_CHECK(gpio_isr_handler_add(static_cast<gpio_num_t>(PPSPin), pps_isr_handler, nullptr));
}

static void clear_pps_events()
{
    while (xSemaphoreTake(s_pps_semaphore, 0) == pdTRUE)
    {
    }
}

static void pps_discipline_task(void *parameter)
{
    static constexpr int64_t ppsTimeoutUs = 3500000;
    static constexpr int64_t maxPhaseErrorUsToCorrect = 250000;
    static constexpr int64_t minCorrectionMagnitudeUs = 2;

    int64_t last_pps_us = esp_timer_get_time();
    bool logged_active = false;

    for (;;)
    {
        int64_t edge_us = 0;
        if (xQueueReceive(s_pps_timestamp_queue, &edge_us, pdMS_TO_TICKS(1000)) == pdTRUE)
        {
            last_pps_us = edge_us;
            s_pps_discipline_active.store(true);
            sync_state_note_pps_edge(edge_us);

            if (!logged_active)
            {
                if (debugIsOn)
                    ESP_LOGI(TAG, "PPS discipline active.");
                logged_active = true;
            }

            if (!s_time_has_been_set.load() || s_time_setting_in_progress.load())
                continue;

            if (xSemaphoreTake(s_time_mutex, pdMS_TO_TICKS(20)) != pdTRUE)
                continue;

            int64_t processing_now_us = esp_timer_get_time();
            struct timeval now{};
            gettimeofday(&now, nullptr);

            int64_t current_time_us = static_cast<int64_t>(now.tv_sec) * 1000000LL + static_cast<int64_t>(now.tv_usec);
            int64_t wake_delay_us = processing_now_us - edge_us;
            if (wake_delay_us < 0)
                wake_delay_us = 0;
            int64_t edge_time_us = current_time_us - wake_delay_us;

            int64_t phase_error_us = edge_time_us % 1000000LL;
            if (phase_error_us > 500000)
                phase_error_us -= 1000000;
            else if (phase_error_us < -500000)
                phase_error_us += 1000000;

            int64_t correction_us = -phase_error_us;
            if (llabs(correction_us) >= minCorrectionMagnitudeUs && llabs(phase_error_us) <= maxPhaseErrorUsToCorrect)
            {
                struct timeval delta{};
                delta.tv_sec = static_cast<time_t>(correction_us / 1000000LL);
                delta.tv_usec = static_cast<suseconds_t>(correction_us % 1000000LL);
                if (delta.tv_usec < 0)
                {
                    delta.tv_usec += 1000000;
                    delta.tv_sec -= 1;
                }

                if (adjtime(&delta, nullptr) == 0)
                {
                    s_ntp_reference_time_64 = get_current_time_in_ntp64_format();
                    s_ntp_reference_valid = true;
                }
            }

            xSemaphoreGive(s_time_mutex);
        }
        else
        {
            int64_t now_us = esp_timer_get_time();
            if ((now_us - last_pps_us) > ppsTimeoutUs)
            {
                if (logged_active && debugIsOn)
                    ESP_LOGW(TAG, "PPS discipline inactive (PPS signal unavailable).");
                logged_active = false;
                s_pps_discipline_active.store(false);
                sync_state_note_pps_timeout(now_us);
            }
        }

