roblatour/ESP32TimeServer/main/main.cpp
        /*

        // The following code is used to determine the ideal stack size for this method (pps_discipline_task)
        // it only needs to be setup and run once
        //
        // NOTE 1: Specific to pps_discipline_task to get a valid result the code below needed to be running
        //         with the Stack report usage display being examined when anPPS event happens (every second)
        //
        // NOTE 2: Results were taken after a minute to allow the numbers to settle in
        //
        // NOTE 3: The following is required to have the code directly below compile (build):
        //         From the ESP-IDF Terminal enter the command
        //            idf.py menuconfig
        //            (the menu screen may take 30 seconds or more to load)
        //         Navigate to:
        //            Component config → FreeRTOS → Kernel
        //         use the down arrow key to scroll down to
        //            configUSE_TRACE_FACILITY
        //            enable FreeTOS trace facility by pressing the space bar (puts a star in the option [*] to signify it is enabled)
        //         press 'S' (enter) to save the change
        //         press 'Q' to quit
        //         code should now build, flash and run ok
        //
        //         once the ideal stack size is known, the code can below can be commented out and the configUSE_TRACE_FACILITY disabled to save RAM
        //
        // NOTE 4: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:
        //

        // *** Hard‑coded stack size originally used when creating the task (bytes) ***
        const size_t allocated_bytes = 16384; // <-- set this to the value passed to xTaskCreatePinnedToCore

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;
        size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.25);

        ESP_LOGI("pps_discipline_task",
                 "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 (unsigned)allocated_bytes,
                 (unsigned)high_watermark_bytes,
                 (unsigned)peak_usage_bytes,
                 (unsigned)suggested_bytes);

        // Results of this testing (when a PPS event was underway):
        //
        // pps_discipline_task: Stack report: Allocated=16384 bytes, HighWater=14556 bytes unused, PeakUsage=1828 bytes, Suggested=2385 bytes

       */
    }
}

static void setup_gps()
{

    static constexpr int maxAttemptsToInitializeGPS = 10;

    gps_nvs_data_t stored_gps_data{};
    bool gps_nvs_load_ok = load_gps_nvs_data(&stored_gps_data);

    bool first_time_initial_setup = !stored_gps_data.has_id_type;
    ESP_LOGI(TAG, "Startup mode: %s", first_time_initial_setup ? "First time initial setup" : "Not first time initial setup");

    s_attempt_no_signal_recovery = resolve_initial_attempt_no_signal_recovery(stored_gps_data);
    if (gps_nvs_load_ok && !stored_gps_data.has_attempt_no_signal_recovery)
    {
        bool save_recovery_setting_ok = save_attempt_no_signal_recovery_setting(s_attempt_no_signal_recovery);
        if (debugIsOn)
            ESP_LOGI(TAG, "GPS no-signal recovery default initialized to %s (save=%s)",
                     s_attempt_no_signal_recovery ? "true" : "false",
                     save_recovery_setting_ok ? "ok" : "failed");
    }

    uint32_t highest_candidate_baud = get_highest_candidate_gps_baud();
    uint32_t startup_target_baud = highest_candidate_baud;

    if (gps_nvs_load_ok && stored_gps_data.has_id_type && stored_gps_data.max_baud > 0)
        startup_target_baud = stored_gps_data.max_baud;

    bool known_module_fast_path = gps_nvs_load_ok && stored_gps_data.has_id_type && stored_gps_data.max_baud > 0;
    if (debugIsOn)
        ESP_LOGI(TAG,
                 "GPS startup path: %s (target baud=%lu)",
                 known_module_fast_path ? "known module fast path" : "first-time scan path",
                 static_cast<unsigned long>(startup_target_baud));

    s_gps_target_baud = startup_target_baud;
    uint32_t initial_probe_baud = first_time_initial_setup ? 9600 : s_gps_target_baud;

    if (!set_gps_baud_rate(s_gps_target_baud, maxAttemptsToInitializeGPS, initial_probe_baud))
    {
        ESP_LOGE(TAG, "GPS comms failed - check TX/RX + power");
        halt_with_display("GPS comms failed", "Check TX/RX + power", "See serial log");
    }

    gps_identity_t current_identity = query_gps_identity();
    bool should_retry_as_first_time = gps_nvs_load_ok && stored_gps_data.has_id_type;
    if (should_retry_as_first_time)
    {
        bool same_gps_module = gps_identity_matches(stored_gps_data, current_identity);
        if (!same_gps_module && startup_target_baud != highest_candidate_baud)
        {
            s_gps_target_baud = highest_candidate_baud;
            if (!set_gps_baud_rate(s_gps_target_baud, maxAttemptsToInitializeGPS, s_gps_target_baud))
            {
                ESP_LOGE(TAG, "GPS comms failed after module mismatch fallback");
                halt_with_display("GPS comms failed", "Check TX/RX + power", "See serial log");
            }
            current_identity = query_gps_identity();
        }
    }

    if (debugIsOn)
        ESP_LOGI(TAG, "GPS startup mode: baud=%lu, initialization=%s",
                 static_cast<unsigned long>(s_detected_gps_baud),
                 s_gps_required_assume_success ? "assume_success" : "confirmed");

    if (s_detected_gps_baud > 0)
    {
        bool save_ok = save_gps_nvs_data(current_identity, s_detected_gps_baud);
        if (debugIsOn)
            ESP_LOGI(TAG,
                     "GPS identity persistence: type=%s, value=%s, max_baud=%lu, save=%s",
                     current_identity.type,
                     current_identity.value,
                     static_cast<unsigned long>(s_detected_gps_baud),
                     save_ok ? "ok" : "failed");
    }

    bool uart1_output_set = false;
    configure_gps_outputs(&uart1_output_set);
    if (!uart1_output_set)
    {
        if (debugIsOn)
            ESP_LOGW(TAG, "GPS UART1 output configuration failed. Continuing with the module's current output settings.");
    }

