roblatour/ESP32TimeServer/main/main.cpp
    s_use_nmea_fallback = s_gps_required_assume_success || !uart1_output_set;
    if (s_use_nmea_fallback && !allowFallbackProcessing)
    {
        ESP_LOGE(TAG, "NMEA fallback processing is required but not allowed - check the ESP32TimeServerSetting.h file.");
        halt_with_display("GPS fallback required", "Fallback not allowed", "Check settings");
    }

    if (s_use_nmea_fallback && debugIsOn)
        ESP_LOGW(TAG, "NMEA fallback mode enabled for GPS fix/time acquisition.");

    display_line(1, "Waiting for GPS fix");
    display_line(2, "");

    static constexpr uint32_t gpsFixEscalationToNmeaFallbackMs = 120000UL;
    static constexpr uint32_t gpsNoSignalRecoveryMs = 180000UL;

    bool no_signal_recovery_attempted = false;
    uint32_t wait_start_ms = millis();
    uint32_t last_status_log_ms = 0;
    uint32_t last_long_wait_warning_ms = 0;

    for (;;)
    {
        uint8_t fix_type = 0;
        bool gnss_fix_ok = false;
        uint8_t satellites_used = 0;
        bool date_valid = false;
        bool time_valid = false;
        bool ubx_fix_ready = false;
        bool nmea_fix_ready = false;

        if (!s_use_nmea_fallback)
        {
            fix_type = s_gps.getFixType();
            gnss_fix_ok = s_gps.getGnssFixOk();
            satellites_used = s_gps.getSIV();
            date_valid = s_gps.getDateValid();
            time_valid = s_gps.getTimeValid();
            ubx_fix_ready = (fix_type > 0 && fix_type < 6) && gnss_fix_ok && date_valid && time_valid;

            char satellites_line[lcdColumns + 1];
            snprintf(satellites_line, sizeof(satellites_line), "Satellites: %u", static_cast<unsigned int>(satellites_used));
            display_line(2, satellites_line);
        }

        uint32_t now_ms = millis();
        if (!ubx_fix_ready && !s_use_nmea_fallback && allowFallbackProcessing && (now_ms - wait_start_ms) >= gpsFixEscalationToNmeaFallbackMs)
        {
            s_use_nmea_fallback = true;
            if (debugIsOn)
                ESP_LOGW(TAG, "No UBX fix after %lu ms. Enabling NMEA fallback for additional acquisition path.", static_cast<unsigned long>(now_ms - wait_start_ms));
        }

        if (!ubx_fix_ready && !s_use_nmea_fallback && !no_signal_recovery_attempted && s_attempt_no_signal_recovery && satellites_used == 0 && (now_ms - wait_start_ms) >= gpsNoSignalRecoveryMs)
        {
            no_signal_recovery_attempted = true;
            if (perform_extended_no_signal_recovery())
            {
                wait_start_ms = millis();
                last_status_log_ms = 0;
                last_long_wait_warning_ms = 0;
                continue;
            }
        }

        if (!ubx_fix_ready && s_use_nmea_fallback)
        {
            nmea_rmc_time_t nmea_time{};
            nmea_fix_ready = wait_for_nmea_rmc_time(&nmea_time, 1200UL);
        }

        if (ubx_fix_ready || nmea_fix_ready)
        {
            if (debugIsOn)
            {
                if (ubx_fix_ready)
                {
                    ESP_LOGI(TAG, "GPS fix obtained after %lu ms: fix_type=%u (%s)",
                             static_cast<unsigned long>(millis() - wait_start_ms),
                             static_cast<unsigned int>(fix_type),
                             fix_type_to_text(fix_type));
                }
                else
                {
                    ESP_LOGI(TAG, "GPS fix obtained after %lu ms via NMEA fallback.",
                             static_cast<unsigned long>(millis() - wait_start_ms));
                }
            }

            display_line(1, "GPS fix obtained");
            display_line(2, ubx_fix_ready ? fix_type_to_text(fix_type) : "NMEA fallback");
            vTaskDelay(pdMS_TO_TICKS(5000));
            return;
        }

        if (last_status_log_ms == 0 || (now_ms - last_status_log_ms) >= 5000UL)
        {
            if (debugIsOn)
            {
                if (s_use_nmea_fallback)
                {
                    ESP_LOGI(TAG, "Waiting for GPS fix: elapsed=%lu ms, NMEA fallback active",
                             static_cast<unsigned long>(now_ms - wait_start_ms));
                }
                else
                {
                    ESP_LOGI(TAG, "Waiting for GPS fix: elapsed=%lu ms, fix_type=%u (%s), gnss_fix_ok=%s, date_valid=%s, time_valid=%s, SIV=%u",
                             static_cast<unsigned long>(now_ms - wait_start_ms),
                             static_cast<unsigned int>(fix_type),
                             fix_type_to_text(fix_type),
                             gnss_fix_ok ? "true" : "false",
                             date_valid ? "true" : "false",
                             time_valid ? "true" : "false",
                             static_cast<unsigned int>(satellites_used));
                }
            }
            last_status_log_ms = now_ms;
        }

        if ((now_ms - wait_start_ms) >= 60000UL && (last_long_wait_warning_ms == 0 || (now_ms - last_long_wait_warning_ms) >= 30000UL))
        {
            if (debugIsOn)
                ESP_LOGW(TAG, "GPS has not produced a usable fix yet. Check antenna placement, sky view, and module compatibility.");
            last_long_wait_warning_ms = now_ms;
        }

        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

static void arduino_eth_event_handler(arduino_event_id_t event, arduino_event_info_t info)
{
    switch (event)
    {
    case ARDUINO_EVENT_ETH_START:
        if (debugIsOn)
            ESP_LOGI(TAG, "Ethernet driver started");
        ETH.setHostname(DeviceName);
        display_line(1, "Ethernet started");
        break;
    case ARDUINO_EVENT_ETH_CONNECTED:
        if (debugIsOn)
            ESP_LOGI(TAG, "Ethernet link connected");
        xEventGroupSetBits(s_net_event_group, ETH_CONNECTED_BIT);
        display_line(1, "Ethernet connected");
        break;
    case ARDUINO_EVENT_ETH_GOT_IP:
        snprintf(s_ip_address, sizeof(s_ip_address), IPSTR, IP2STR(&info.got_ip.ip_info.ip));
        if (debugIsOn)
            ESP_LOGI(TAG,
                     "Ethernet IP acquired: ip=" IPSTR ", mask=" IPSTR ", gw=" IPSTR,
                     IP2STR(&info.got_ip.ip_info.ip),
                     IP2STR(&info.got_ip.ip_info.netmask),
                     IP2STR(&info.got_ip.ip_info.gw));
        xEventGroupSetBits(s_net_event_group, ETH_GOT_IP_BIT);
        display_line(3, s_ip_address);
        break;
    case ARDUINO_EVENT_ETH_LOST_IP:
        if (debugIsOn)
            ESP_LOGW(TAG, "Ethernet lost IP address");
        xEventGroupClearBits(s_net_event_group, ETH_GOT_IP_BIT);
        s_ip_address[0] = '\0';
        display_line(1, "Ethernet lost IP");
        display_line(3, "");
        break;
    case ARDUINO_EVENT_ETH_DISCONNECTED:
        if (debugIsOn)
            ESP_LOGW(TAG, "Ethernet link disconnected");
        xEventGroupClearBits(s_net_event_group, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT);
        s_ip_address[0] = '\0';
        display_line(1, "Ethernet disconnect");
        display_line(3, "");
        break;
    case ARDUINO_EVENT_ETH_STOP:
        if (debugIsOn)
            ESP_LOGW(TAG, "Ethernet driver stopped");
        xEventGroupClearBits(s_net_event_group, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT);
        s_ip_address[0] = '\0';
        display_line(1, "Ethernet stopped");
        display_line(3, "");
        break;
    default:
        break;
    }
}

