roblatour/ESP32TimeServer/main/main.cpp
// Apply the optional static IP address configuration from ESP32TimeServerSettings.h.
// When StaticIPAddress is empty this is a no-op and the Ethernet interface falls back
// to DHCP (the default behaviour). Returns true when a static IP was applied, false otherwise.
static bool configure_static_ip()
{
    // An empty StaticIPAddress means DHCP should be used - nothing to do here
    if (StaticIPAddress[0] == '\0')
        return false;

    IPAddress local_ip, gateway, subnet;
    if (!local_ip.fromString(StaticIPAddress))
    {
        ESP_LOGE(TAG, "Configured StaticIPAddress is invalid: %s", StaticIPAddress);
        return false;
    }
    if (!gateway.fromString(Gateway))
    {
        ESP_LOGE(TAG, "Configured Gateway is invalid: %s", Gateway);
        return false;
    }
    if (!subnet.fromString(SubnetMask))
    {
        ESP_LOGE(TAG, "Configured SubnetMask is invalid: %s", SubnetMask);
        return false;
    }

    // DNS servers are optional; default to 0.0.0.0 (unset) when left blank
    IPAddress dns1, dns2;
    if (PrimaryDNS[0] != '\0')
    {
        if (!dns1.fromString(PrimaryDNS))
        {
            ESP_LOGE(TAG, "Configured PrimaryDNS is invalid: %s", PrimaryDNS);
            return false;
        }
    }
    if (SecondaryDNS[0] != '\0')
    {
        if (!dns2.fromString(SecondaryDNS))
        {
            ESP_LOGE(TAG, "Configured SecondaryDNS is invalid: %s", SecondaryDNS);
            return false;
        }
    }

    if (!ETH.config(local_ip, gateway, subnet, dns1, dns2))
    {
        ESP_LOGE(TAG, "ETH.config() failed to apply the static IP configuration");
        return false;
    }

    if (debugIsOn)
        ESP_LOGI(TAG,
                 "Static IP configuration applied: ip=%s, mask=%s, gw=%s",
                 StaticIPAddress, SubnetMask, Gateway);
    return true;
}

static void setup_ethernet()
{
    if (s_net_event_group == nullptr)
        s_net_event_group = xEventGroupCreate();

    s_ip_address[0] = '\0';
    xEventGroupClearBits(s_net_event_group, ETH_CONNECTED_BIT | ETH_GOT_IP_BIT);

    Network.onEvent(arduino_eth_event_handler);

    if (debugIsOn)
        ESP_LOGI(TAG,
                 "Starting Arduino Ethernet with phy_addr=%d, mdc=%d, mdio=%d, power=%d",
                 ETH_PHY_ADDRESS,
                 static_cast<int>(ETH_MDC_GPIO),
                 static_cast<int>(ETH_MDIO_GPIO),
                 static_cast<int>(ETH_PHY_RST_GPIO));

    if (!ETH.begin(ETH_PHY_IP101,
                   ETH_PHY_ADDRESS,
                   static_cast<int>(ETH_MDC_GPIO),
                   static_cast<int>(ETH_MDIO_GPIO),
                   static_cast<int>(ETH_PHY_RST_GPIO),
                   EMAC_CLK_EXT_IN))
    {
        if (debugIsOn)
            ESP_LOGE(TAG, "ETH.begin() failed");
        return;
    }

    // Apply the optional static IP address (if configured). When StaticIPAddress is
    // left empty this is a no-op and DHCP is used as usual.
    bool static_ip_applied = configure_static_ip();

    if (debugIsOn)
        ESP_LOGI(TAG,
                 "Waiting for Ethernet %s address...",
                 static_ip_applied ? "static" : "DHCP");
    xEventGroupWaitBits(s_net_event_group, ETH_GOT_IP_BIT, pdFALSE, pdTRUE, portMAX_DELAY);
    if (debugIsOn)
        ESP_LOGI(TAG, "Ethernet setup complete, current IP: %s", s_ip_address[0] == '\0' ? "<none>" : s_ip_address);
}

void write_opening_messages_to_the_console()
{

    Serial.begin(serialMonitorSpeed);
    vTaskDelay(pdMS_TO_TICKS(100));

    ESP_LOGI(TAG, "");
    ESP_LOGI(TAG, "******************* Application Startup *******************");
    ESP_LOGI(TAG, "ESP32 Time Sever v2.3.1");

    if (!debugIsOn)
    {
        ESP_LOGW(TAG, "debugIsOn is turned off in the settings");
        ESP_LOGW(TAG, "No further application generate console displays will be generated");
        return;
    };

    if (supportForAnUpTimeRestartButton)
        ESP_LOGI(TAG, "Up time / Reset button support is turned on in settings");
    else
        ESP_LOGW(TAG, "Up time / Reset button support is turned off in settings");

    if (supportForLiquidCrystalDisplay)
        ESP_LOGI(TAG, "LCD support is turned on in settings");
    else
        ESP_LOGW(TAG, "LCD support is turned off in settings");

    if (supportForOTEUpdates)
        ESP_LOGI(TAG, "Over the Ethernet update support is turned on in settings");
    else
        ESP_LOGW(TAG, "Over the Ethernet update support is turned off in settings");
}

void setup_NVM_storage(void)
{

    if (!initialize_nvs_storage())
        ESP_LOGE(TAG, "NVS initialization failed. GPS module persistence is unavailable.");
}

void create_mutexes_and_semaphores(void)
{

    s_lcd_mutex = xSemaphoreCreateMutex();
    s_time_mutex = xSemaphoreCreateMutex();
    s_pps_semaphore = xSemaphoreCreateBinary();
    s_pps_timestamp_queue = xQueueCreate(1, sizeof(int64_t));
    s_ota_mutex = xSemaphoreCreateMutex();
    s_sync_state_mutex = xSemaphoreCreateMutex();
}

void initialize_the_display(void)
{

    if (!supportForLiquidCrystalDisplay)
        return;

    if (setup_lcd() == ESP_OK)
    {
        display_line(0, "ESP32 Time Server");
        display_line(1, "");
        display_line(2, "");
        display_line(3, "");
    }
    else
    {
        if (debugIsOn)
            ESP_LOGE(TAG, "LCD setup failed");
    }
}

static void setup_up_time_button()
{

    if (supportForAnUpTimeRestartButton)
    {
        gpio_config_t config{};
        config.pin_bit_mask = 1ULL << upTimeRestartPin;
        config.mode = GPIO_MODE_INPUT;
        config.pull_up_en = GPIO_PULLUP_ENABLE;
        config.pull_down_en = GPIO_PULLDOWN_DISABLE;
        config.intr_type = GPIO_INTR_DISABLE;
        ESP_ERROR_CHECK(gpio_config(&config));
    }
}

static void configure_mac_address()
{
    if (MACAddress[0] == '\0')
        return;

    uint8_t mac[6] = {};
    if (!parse_mac_id_string(MACAddress, mac))
    {
        ESP_LOGE(TAG, "Configured MAC address is invalid: %s", MACAddress);
        return;
    }

    esp_err_t err = esp_base_mac_addr_set(mac);
    if (err != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to set MAC address to %s: %s", MACAddress, esp_err_to_name(err));
        return;
    }

    ESP_LOGI(TAG, "Configured MACAddress applied: " MACSTR, MAC2STR(mac));
}

void setup_ethernet_connection()
{

    configure_mac_address();

