roblatour/ESP32TimeServer/main/main.cpp
    display_line(1, "Connecting Ethernet");
    display_line(2, "");
    setup_ethernet();
    display_line(3, s_ip_address);
}

static void ota_copy_reason(char *destination, size_t destination_size, const char *reason)
{
    if (destination_size == 0)
        return;

    if (reason == nullptr || reason[0] == '\0')
    {
        destination[0] = '\0';
        return;
    }

    snprintf(destination, destination_size, "%s", reason);
}

static void ota_set_running_state(unsigned int progress, unsigned int total)
{
    if (xSemaphoreTake(s_ota_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_ota_in_progress = true;
        s_ota_failed = false;
        s_ota_success = false;
        s_ota_failure_display_until_us = 0;
        s_ota_reboot_at_us = 0;
        s_ota_error_reason[0] = '\0';
        s_ota_progress_percent = total == 0 ? 0 : static_cast<int>((progress * 100U) / total);
        xSemaphoreGive(s_ota_mutex);
    }
}

static void ota_set_failure_state(const char *reason)
{
    if (xSemaphoreTake(s_ota_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_ota_in_progress = false;
        s_ota_failed = true;
        s_ota_success = false;
        s_ota_failure_display_until_us = esp_timer_get_time() + static_cast<int64_t>(OTA_Failure_Display_Time_Ms) * 1000LL;
        s_ota_reboot_at_us = 0;
        ota_copy_reason(s_ota_error_reason, sizeof(s_ota_error_reason), reason);
        xSemaphoreGive(s_ota_mutex);
    }
}

static void ota_set_success_state()
{
    if (xSemaphoreTake(s_ota_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_ota_in_progress = false;
        s_ota_failed = false;
        s_ota_success = true;
        s_ota_progress_percent = 100;
        s_ota_failure_display_until_us = 0;
        s_ota_reboot_at_us = esp_timer_get_time() + static_cast<int64_t>(OTA_Reboot_Delay_Ms) * 1000LL;
        s_ota_error_reason[0] = '\0';
        xSemaphoreGive(s_ota_mutex);
    }
}

static void format_ota_error_reason(ota_error_t error, char *buffer, size_t buffer_size)
{
    const char *update_error = Update.errorString();
    if ((error == OTA_BEGIN_ERROR || error == OTA_END_ERROR) && update_error != nullptr && strcmp(update_error, "No Error") != 0)
    {
        snprintf(buffer, buffer_size, "%s", update_error);
        return;
    }

    switch (error)
    {
    case OTA_AUTH_ERROR:
        snprintf(buffer, buffer_size, "%s", "Auth Failed");
        break;
    case OTA_BEGIN_ERROR:
        snprintf(buffer, buffer_size, "%s", "Begin Failed");
        break;
    case OTA_CONNECT_ERROR:
        snprintf(buffer, buffer_size, "%s", "Connect Failed");
        break;
    case OTA_RECEIVE_ERROR:
        snprintf(buffer, buffer_size, "%s", "Receive Failed");
        break;
    case OTA_END_ERROR:
        snprintf(buffer, buffer_size, "%s", "End Failed");
        break;
    default:
        snprintf(buffer, buffer_size, "%s", "Unknown Error");
        break;
    }
}

static bool render_ota_display()
{
    bool ota_in_progress = false;
    bool ota_failed = false;
    bool ota_success = false;
    int ota_progress_percent = -1;
    int64_t ota_failure_display_until_us = 0;
    int64_t ota_reboot_at_us = 0;
    char ota_error_reason[lcdColumns + 1] = "";

    if (xSemaphoreTake(s_ota_mutex, portMAX_DELAY) != pdTRUE)
        return false;

    ota_in_progress = s_ota_in_progress;
    ota_failed = s_ota_failed;
    ota_success = s_ota_success;
    ota_progress_percent = s_ota_progress_percent;
    ota_failure_display_until_us = s_ota_failure_display_until_us;
    ota_reboot_at_us = s_ota_reboot_at_us;
    ota_copy_reason(ota_error_reason, sizeof(ota_error_reason), s_ota_error_reason);
    xSemaphoreGive(s_ota_mutex);

    int64_t now_us = esp_timer_get_time();
    if (!ota_in_progress && !ota_failed && !ota_success)
        return false;

    if (ota_failed && ota_failure_display_until_us > 0 && now_us >= ota_failure_display_until_us)
    {
        if (xSemaphoreTake(s_ota_mutex, portMAX_DELAY) == pdTRUE)
        {
            s_ota_failed = false;
            s_ota_progress_percent = -1;
            s_ota_error_reason[0] = '\0';
            s_ota_failure_display_until_us = 0;
            xSemaphoreGive(s_ota_mutex);
        }
        return false;
    }

    if (ota_in_progress)
    {
        char progress_line[lcdColumns + 1];
        snprintf(progress_line, sizeof(progress_line), "%d%% complete", ota_progress_percent < 0 ? 0 : ota_progress_percent);
        display_line(1, "OTA update started");
        display_line(2, progress_line);
        display_line(3, "Uploading firmware");
        return true;
    }

    if (ota_success)
    {
        (void)ota_reboot_at_us;
        display_line(1, "OTA successful");
        display_line(2, "100% complete");
        display_line(3, "Rebooting in 5 sec");
        return true;
    }

    display_line(1, "OTA failed");
    display_line(2, ota_error_reason[0] == '\0' ? "Unknown reason" : ota_error_reason);
    display_line(3, "Resuming in 10 sec");
    return true;
}

static void ota_service_task(void *parameter)
{
    if (debugIsOn)
        ESP_LOGI(TAG, "OTA service task started on port %u", static_cast<unsigned int>(OTA_Port));

    // uint32_t last_heartbeat_ms = 0;   // uncomment this line and the block below if you want to see a heart beat message in the console log every 10 seconds

    for (;;)
    {
        ArduinoOTA.handle();

        // uncomment the following if you want to see a heart beat message in the console log every 10 seconds
        /*
        uint32_t now_ms = millis();
        if (last_heartbeat_ms == 0 || (now_ms - last_heartbeat_ms) >= 10000UL)
        {

            if (debugIsOn)
                ESP_LOGI(TAG,
                         "OTA heartbeat: online=%s, ip=%s, in_progress=%s",
                         Network.isOnline() ? "true" : "false",
                         s_ip_address[0] == '\0' ? "<none>" : s_ip_address,
                         s_ota_in_progress ? "true" : "false");

            last_heartbeat_ms = now_ms;
        }
        */

        bool should_reboot = false;
        TickType_t loop_delay_ticks = pdMS_TO_TICKS(50);
        if (xSemaphoreTake(s_ota_mutex, portMAX_DELAY) == pdTRUE)
        {
            bool ota_idle = !s_ota_in_progress && !s_ota_failed && !s_ota_success;
            if (ota_idle)
                loop_delay_ticks = pdMS_TO_TICKS(200);

            if (s_ota_success && s_ota_reboot_at_us > 0 && esp_timer_get_time() >= s_ota_reboot_at_us)
                should_reboot = true;
            xSemaphoreGive(s_ota_mutex);
        }

        vTaskDelay(loop_delay_ticks);
        if (should_reboot)
            esp_restart();

