roblatour/ESP32TimeServer/main/main.cpp
        /*

        // The following code is used to determine the ideal stack size for this method (ota_service_task)
        // it only needs to be setup and run once
        //
        // NOTE 1: Specific to ota_service_task to get a valid result the code below needed to be running
        //         with the Stack report usage display being examined when an OTA update was underway
        //
        // NOTE 2: The following is required to have the code directly below compile (build):
        //         From the ESP-IDF Terminal enter the command
        //            idf.py menuconfig
        //            (the menu screen may take 30 seconds or more to load)
        //         Navigate to:
        //            Component config → FreeRTOS → Kernel
        //         use the down arrow key to scroll down to
        //            configUSE_TRACE_FACILITY
        //            enable FreeTOS trace facility by pressing the space bar (puts a star in the option [*] to signify it is enabled)
        //         press 'S' (enter) to save the change
        //         press 'Q' to quit
        //         code should now build, flash and run ok
        //
        //         once the ideal stack size is known, the code can below can be commented out and the configUSE_TRACE_FACILITY disabled to save RAM
        //
        // NOTE 3: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:
        //

        // *** Hard‑coded stack size originally used when creating the task (bytes) ***
        const size_t allocated_bytes = 16384; // <-- set this to the value passed to xTaskCreatePinnedToCore

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;
        size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.25);

        ESP_LOGI("ota_service_task",
                 "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 (unsigned)allocated_bytes,
                 (unsigned)high_watermark_bytes,
                 (unsigned)peak_usage_bytes,
                 (unsigned)suggested_bytes);

        // Results of this testing (when an OTA update was underway):
        //
        // ota_service_task: Stack report: Allocated=16384 bytes, HighWater=13536 bytes unused, PeakUsage=2848 bytes, Suggested=3560 bytes

        */
    }
}

static void setup_ota()
{
    if (xSemaphoreTake(s_ota_mutex, portMAX_DELAY) == pdTRUE)
    {
        s_ota_in_progress = false;
        s_ota_failed = false;
        s_ota_success = false;
        s_ota_progress_percent = -1;
        s_ota_failure_display_until_us = 0;
        s_ota_reboot_at_us = 0;
        s_ota_error_reason[0] = '\0';
        xSemaphoreGive(s_ota_mutex);
    }

    bool network_begin_ok = Network.begin();
    if (debugIsOn)
        ESP_LOGI(TAG,
                 "Arduino Network.begin()=%s, online=%s, current_ip=%s",
                 network_begin_ok ? "true" : "false",
                 Network.isOnline() ? "true" : "false",
                 s_ip_address[0] == '\0' ? "<none>" : s_ip_address);
    if (debugIsOn)
        ESP_LOGI(TAG,
                 "Configuring ArduinoOTA: host=%s, port=%u, password_length=%u",
                 DeviceName,
                 static_cast<unsigned int>(OTA_Port),
                 static_cast<unsigned int>(strlen(OTA_Password)));

    ArduinoOTA.setPort(OTA_Port);
    ArduinoOTA.setHostname(DeviceName);
    ArduinoOTA.setPassword(OTA_Password);
    ArduinoOTA.setRebootOnSuccess(false);
    ArduinoOTA.onStart([]()
                       {
        ota_set_running_state(0, 1);
        if (debugIsOn) ESP_LOGI(TAG, "OTA update started"); });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
                          { ota_set_running_state(progress, total); });
    ArduinoOTA.onEnd([]()
                     {
        ota_set_success_state();
        if (debugIsOn) ESP_LOGI(TAG, "OTA update completed successfully"); });
    ArduinoOTA.onError([](ota_error_t error)
                       {
        char reason[lcdColumns + 1];
        format_ota_error_reason(error, reason, sizeof(reason));
        ota_set_failure_state(reason);
        if (debugIsOn) ESP_LOGE(TAG, "OTA update failed: %s", reason); });
    if (debugIsOn)
        ESP_LOGI(TAG, "Calling ArduinoOTA.begin()...");
    ArduinoOTA.begin();

    if (debugIsOn)
        ESP_LOGI(TAG,
                 "ArduinoOTA.begin() returned, listener should be available on %s:%u",
                 s_ip_address[0] == '\0' ? DeviceName : s_ip_address,
                 static_cast<unsigned int>(OTA_Port));
}

void setup_for_ota_updates()
{
    if (!supportForOTEUpdates)
        return;

    display_line(1, "Setup OTA");
    display_line(2, "");
    setup_ota();

    // note: this task is intentionally pinned to core 0 (as opposed to tskNO_AFFINITY)
    xTaskCreatePinnedToCore(ota_service_task, "ota_service", 3560, nullptr, 5, nullptr, 0);
}

static bool acquire_sync_candidate(sync_candidate_t *candidate)
{
    if (candidate == nullptr)
        return false;

    *candidate = sync_candidate_t{};
    candidate->used_nmea_fallback = s_use_nmea_fallback;
    candidate->pps_release_time_us = esp_timer_get_time();
    int64_t attempt_start_us = candidate->pps_release_time_us;

    if (s_use_nmea_fallback)
    {
        nmea_rmc_time_t nmea_time{};
        if (!wait_for_nmea_rmc_time(&nmea_time, 3000UL))
        {
            candidate->failure = sync_fault_t::gps_invalid;
            return false;
        }

        candidate->candidate_time = epoch_from_utc(nmea_time.year, nmea_time.month, nmea_time.day, nmea_time.hour, nmea_time.minute, nmea_time.second);

        clear_pps_events();
        if (xSemaphoreTake(s_pps_semaphore, pdMS_TO_TICKS(1500)) == pdTRUE)
        {
            candidate->use_pps_alignment = true;
            candidate->pps_release_time_us = esp_timer_get_time();
            candidate->candidate_time += 1;
        }
        else
        {
            if (debugIsOn)
                ESP_LOGE(TAG, "NMEA fallback is running without PPS.");

            if (!allowFallbackProcessingWithoutPPS)
            {
                candidate->failure = sync_fault_t::pps_missing;
                return false;
            }

            candidate->pps_release_time_us = esp_timer_get_time();
        }
    }
    else
    {
        clear_pps_events();
        if (xSemaphoreTake(s_pps_semaphore, pdMS_TO_TICKS(1500)) != pdTRUE)
        {
            if (debugIsOn)
                ESP_LOGE(TAG, "UBX mode is running without PPS.");

