roblatour/ESP32TimeServer/main/main.cpp
            candidate->failure = sync_fault_t::pps_missing;
            if (allowFallbackProcessingWithoutPPS)
            {
                if (debugIsOn)
                    ESP_LOGW(TAG, "Switching to NMEA fallback because PPS is unavailable.");
                s_use_nmea_fallback = true;
            }
            return false;
        }

        if (!s_gps.getPVT())
        {
            candidate->failure = sync_fault_t::gps_invalid;
            return false;
        }

        if (!s_gps.getDateValid() || !s_gps.getTimeValid())
        {
            candidate->failure = sync_fault_t::gps_invalid;
            return false;
        }

        int year = s_gps.getYear();
        int month = s_gps.getMonth();
        int day = s_gps.getDay();
        int hour = s_gps.getHour();
        int minute = s_gps.getMinute();
        int second = s_gps.getSecond();

        if (year <= 2022 || month < 1 || month > 12 || day < 1 || day > 31 || hour < 0 || hour > 23 || minute < 0 || minute > 59 || second < 0 || second > 60)
        {
            candidate->failure = sync_fault_t::gps_invalid;
            return false;
        }

        candidate->candidate_time = epoch_from_utc(year, month, day, hour, minute, second) + 1;

        vTaskDelay(pdMS_TO_TICKS(200));

        clear_pps_events();
        if (xSemaphoreTake(s_pps_semaphore, pdMS_TO_TICKS(1500)) != pdTRUE)
        {
            if (debugIsOn)
                ESP_LOGE(TAG, "UBX mode lost PPS alignment pulse.");

            candidate->failure = sync_fault_t::pps_missing;
            if (allowFallbackProcessingWithoutPPS)
            {
                if (debugIsOn)
                    ESP_LOGW(TAG, "Switching to NMEA fallback because PPS is unavailable.");
                s_use_nmea_fallback = true;
            }
            return false;
        }

        candidate->pps_release_time_us = esp_timer_get_time();
        candidate->use_pps_alignment = true;
    }

    if ((esp_timer_get_time() - attempt_start_us) > Max_Sync_Attempt_Us)
    {
        candidate->failure = sync_fault_t::gps_invalid;
        return false;
    }

    candidate->used_nmea_fallback = s_use_nmea_fallback;
    return true;
}

static void handle_runtime_sync_failure(sync_fault_t fault, time_t update_delta, uint32_t retry_delay_ms)
{
    uint32_t failure_count = sync_state_note_failure(fault, update_delta);
    sync_state_t snapshot = get_sync_state_snapshot();

    s_time_setting_in_progress.store(false);

    if (failure_count >= Sync_Failures_Before_Runtime_Recovery && (failure_count % Sync_Failures_Before_Runtime_Recovery) == 0)
    {
        if (debugIsOn)
            ESP_LOGW(TAG, "Runtime GPS recovery attempt after %lu consecutive sync failures.", static_cast<unsigned long>(failure_count));
        setup_gps();
        sync_state_reset_failure_counters();
    }

    if (snapshot.last_successful_sync_us > 0 && (esp_timer_get_time() - snapshot.last_successful_sync_us) > Sync_Reboot_After_Us)
    {
        if (debugIsOn)
            ESP_LOGE(TAG, "Rebooting after extended holdover without a successful GPS resync.");
        vTaskDelay(pdMS_TO_TICKS(200));
        esp_restart();
    }

    vTaskDelay(pdMS_TO_TICKS(retry_delay_ms));
}

static void gps_time_sync_task(void *parameter)
{
    bool first_sync = true;

    for (;;)
    {

        /*

        // The following code is used to determine the ideal stack size for this method (gps_time_sync_task)
        // it only needs to be setup and run once
        //
        //
        // NOTE 1: specific to gps_time_sync_task,
        //         in the other tasks the code to get a suggest stack size was added at the end of the method
        //         however as several continues are used in the for loop of this method this
        //         code block has been placed at the top of the loop
        //
        // NOTE 2: specific to gps_time_sync_task, the setting
        //         static constexpr uint32_t periodicGPSRefreshEveryThisNumberOfMinutes
        //         had its normal value of 5UL to resync with GPS every 5 minutes
        //         updated to 1UL so that the resync would happen every minute
        //         as the initial run of this task does not provide for a representative suggested stack value
        //         however subsequent runs did provide for a good value that could be used
        //         when testing was complete the periodicGPSRefreshEveryThisNumberOfMinutes was reset to its normal default value
        //
        // NOTE 3: The following is required to have the code directly below compile (build):
        //         From the ESP-IDF Terminal enter the command
        //            idf.py menuconfig
        //            (the menu screen may take 30 seconds or more to load)
        //         Navigate to:
        //            Component config → FreeRTOS → Kernel
        //         use the down arrow key to scroll down to
        //            configUSE_TRACE_FACILITY
        //            enable FreeTOS trace facility by pressing the space bar (puts a star in the option [*] to signify it is enabled)
        //         press 'S' (enter) to save the change
        //         press 'Q' to quit
        //         code should now build, flash and run ok
        //
        //         once the ideal stack size is known, the code can below can be commented out and the configUSE_TRACE_FACILITY disabled to save RAM
        //
        // NOTE 4: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:

        // *** Hard‑coded stack size originally used when creating the task (bytes) ***
        const size_t allocated_bytes = 16384; // <-- set this to the value passed to xTaskCreatePinnedToCore

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;
        size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.25);

        ESP_LOGI("gps_time_sync_task",
                 "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 (unsigned)allocated_bytes,
                 (unsigned)high_watermark_bytes,
                 (unsigned)peak_usage_bytes,
                 (unsigned)suggested_bytes);

        vTaskDelay(pdMS_TO_TICKS(50));

        // Results of this testing:
        //
        // gps_time_sync_task: Stack report: Allocated=16384 bytes, HighWater=14352 bytes unused, PeakUsage=2032 bytes, Suggested=2540 bytes

        */

        s_time_setting_in_progress.store(true);
        sync_state_note_attempt();

        sync_candidate_t candidate{};
        if (!acquire_sync_candidate(&candidate))
        {
            handle_runtime_sync_failure(candidate.failure, 0, 1000);
            continue;
        }

        if (first_sync)
        {
            sync_candidate_t confirmation_candidate{};
            if (!acquire_sync_candidate(&confirmation_candidate))
            {
                handle_runtime_sync_failure(confirmation_candidate.failure, 0, 1000);
                continue;
            }

            if (!first_sync_candidates_are_plausible(candidate, confirmation_candidate))
            {
                handle_runtime_sync_failure(sync_fault_t::gps_invalid, 0, 1000);
                continue;
            }

            candidate = confirmation_candidate;
        }

        time_t update_delta = 0;
        if (!first_sync)
        {
            time_t current_time = time(nullptr);
            update_delta = current_time - candidate.candidate_time;
            bool sanity_check_passed = (update_delta >= -safeguardThresholdInSeconds) && (update_delta <= safeguardThresholdInSeconds);
            if (!sanity_check_passed)
            {
                uint32_t sanity_failure_count = sync_state_note_sanity_retry(update_delta);
                s_time_setting_in_progress.store(false);

