roblatour/ESP32TimeServer/main/main.cpp
                if (debugIsOn)
                    ESP_LOGE(TAG, "Sanity check failed with delta %lld on attempt %lu.", static_cast<long long>(update_delta), static_cast<unsigned long>(sanity_failure_count));

                if (sanity_failure_count < Sanity_Failures_Before_Fault)
                {
                    vTaskDelay(pdMS_TO_TICKS(250));
                    continue;
                }

                s_safe_guard_tripped.store(true);
                sync_state_note_failure(sync_fault_t::sanity_mismatch, update_delta);

                if (rebootIfSanityCheckFails)
                {
                    if (debugIsOn)
                        ESP_LOGE(TAG, "Restarting according to settings.");
                    vTaskDelay(pdMS_TO_TICKS(200));
                    esp_restart();
                }

                vTaskDelay(pdMS_TO_TICKS(1000));
                continue;
            }
        }

        sync_state_clear_sanity_failures();

        if (xSemaphoreTake(s_time_mutex, portMAX_DELAY) == pdTRUE)
        {
            int64_t elapsed_us = candidate.use_pps_alignment ? (esp_timer_get_time() - candidate.pps_release_time_us) : 0;
            if (elapsed_us < 0)
                elapsed_us = 0;

            struct timeval tv{};
            tv.tv_sec = candidate.candidate_time + static_cast<time_t>(elapsed_us / 1000000LL);
            tv.tv_usec = static_cast<suseconds_t>(elapsed_us % 1000000LL);
            settimeofday(&tv, nullptr);
            s_ntp_reference_time_64 = get_current_time_in_ntp64_format();
            s_ntp_reference_valid = true;

            xSemaphoreGive(s_time_mutex);

            s_safe_guard_tripped.store(false);
            s_time_setting_in_progress.store(false);
            s_time_has_been_set.store(true);
            first_sync = false;
            sync_state_note_success(update_delta);

            if (s_attempt_no_signal_recovery)
            {
                bool save_recovery_setting_ok = save_attempt_no_signal_recovery_setting(false);
                s_attempt_no_signal_recovery = false;
                if (debugIsOn)
                    ESP_LOGI(TAG, "GPS time set succeeded; no-signal recovery is now persisted as false (save=%s)", save_recovery_setting_ok ? "ok" : "failed");
            }

            if (debugIsOn)
            {
                char date_string[16] = "";
                char time_string[24] = "";
                time_t now_utc = time(nullptr);
                format_local_date_time(now_utc, date_string, sizeof(date_string), time_string, sizeof(time_string));

                if (candidate.used_nmea_fallback)
                    ESP_LOGI(TAG, "GPS time sync ( using NMEA fallback %s ) on %s at %s", candidate.use_pps_alignment ? "with PPS alignment" : "without PPS alignment", date_string, time_string);
                else
                    ESP_LOGI(TAG, "GPS time sync on %s at %s", date_string, time_string);
            };

            vTaskDelay(pdMS_TO_TICKS(periodicGPSRefreshEveryThisNumberOfMinutes * 60UL * 1000UL));
        }
    }
}

void setup_the_gps()
{

    display_line(1, "GPS setup underway");
    display_line(2, "");

    apply_timezone_settings();

    setup_gps();

    display_line(1, "Getting date & time");
    display_line(2, "");

    xTaskCreatePinnedToCore(gps_time_sync_task, "gps_time_sync", 2540, nullptr, 15, nullptr, tskNO_AFFINITY);
    xTaskCreatePinnedToCore(pps_discipline_task, "pps_discipline", 2385, nullptr, 14, nullptr, tskNO_AFFINITY);

    while (!s_time_has_been_set.load())
        vTaskDelay(pdMS_TO_TICKS(100));
}

static void ntp_server_task(void *parameter)
{
    int sock = socket(AF_INET, SOCK_DGRAM, IPPROTO_IP);
    if (sock < 0)
    {
        if (debugIsOn)
            ESP_LOGE(TAG, "Unable to create UDP socket: errno %d", errno);
        vTaskDelete(nullptr);
        return;
    }

    struct sockaddr_in listen_addr{};
    listen_addr.sin_family = AF_INET;
    listen_addr.sin_port = htons(NTP_PORT);
    listen_addr.sin_addr.s_addr = htonl(INADDR_ANY);

    if (bind(sock, reinterpret_cast<struct sockaddr *>(&listen_addr), sizeof(listen_addr)) != 0)
    {
        if (debugIsOn)
            ESP_LOGE(TAG, "Unable to bind UDP socket: errno %d", errno);
        closesocket(sock);
        vTaskDelete(nullptr);
        return;
    }

    struct timeval timeout{};
    timeout.tv_sec = 1;
    timeout.tv_usec = 0;
    setsockopt(sock, SOL_SOCKET, SO_RCVTIMEO, &timeout, sizeof(timeout));

    for (;;)
    {
        uint8_t request[NTP_PACKET_SIZE];
        uint8_t reply[NTP_PACKET_SIZE];
        struct sockaddr_in source_addr{};
        socklen_t source_addr_len = sizeof(source_addr);

        int len = recvfrom(sock, request, sizeof(request), 0, reinterpret_cast<struct sockaddr *>(&source_addr), &source_addr_len);
        if (len < 0)
        {
            if (errno == EAGAIN || errno == EWOULDBLOCK)
                continue;
            if (debugIsOn)
                ESP_LOGW(TAG, "recvfrom failed: errno %d", errno);
            continue;
        }

        uint64_t receive_time = get_current_time_in_ntp64_format();

        if (len != static_cast<int>(NTP_PACKET_SIZE))
            continue;

        bool reply_ready = false;
        if (xSemaphoreTake(s_time_mutex, portMAX_DELAY) == pdTRUE)
        {
            uint64_t transmit_time = get_current_time_in_ntp64_format();
            build_ntp_reply(request, reply, receive_time, transmit_time);
            xSemaphoreGive(s_time_mutex);
            reply_ready = true;
        }

        if (reply_ready)
        {
            sendto(sock, reply, sizeof(reply), 0, reinterpret_cast<struct sockaddr *>(&source_addr), source_addr_len);
            if (debugIsOn)
            {
                char source_address[16] = "";
                char date_string[16] = "";
                char time_string[24] = "";
                time_t now_utc = time(nullptr);
                inet_ntoa_r(source_addr.sin_addr, source_address, sizeof(source_address));
                format_local_date_time(now_utc, date_string, sizeof(date_string), time_string, sizeof(time_string));
                ESP_LOGI(TAG, "NTP response provided to %s on %s at %s", source_address, date_string, time_string);
            }
        }

