roblatour/ESP32TimeServer/main/main.cpp
        /*

       // The following code is used to determine the ideal stack size for this method (ntp_server_task)
       // it only needs to be setup and run once
       //
       // NOTE 1: specific to ntp_server_task, the Stack report below will only be issued if an NTP request is received.
       //         accordingly, to generate a NTP request for testing the following can be entered via the Windows powershell command line:
       //              w32tm /stripchart /computer:192.168.1.24 /samples:5 /dataonly
       //
       // NOTE 2: The following is required to have the code directly below compile (build):
       //         From the ESP-IDF Terminal enter the command
       //            idf.py menuconfig
       //            (the menu screen may take 30 seconds or more to load)
       //         Navigate to:
       //            Component config → FreeRTOS → Kernel
       //         use the down arrow key to scroll down to
       //            configUSE_TRACE_FACILITY
       //            enable FreeTOS trace facility by pressing the space bar (puts a star in the option [*] to signify it is enabled)
       //         press 'S' (enter) to save the change
       //         press 'Q' to quit
       //         code should now build, flash and run ok
       //
       //         once the ideal stack size is known, the code can below can be commented out and the configUSE_TRACE_FACILITY disabled to save RAM
       //
       // NOTE 3: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
       //
       // Below is the code that has now already been used to calculate the ideal stack size:
       //

       // *** Hard‑coded stack size originally used when creating the task (bytes) ***
       const size_t allocated_bytes = 16384; // <-- set this to the value passed to xTaskCreatePinnedToCore

       // high watermark is returned in words
       UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
       size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

       // compute peak usage and suggested size (25% margin)
       size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;
       size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.25);

       ESP_LOGI("ntp_server_task",
                "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                (unsigned)allocated_bytes,
                (unsigned)high_watermark_bytes,
                (unsigned)peak_usage_bytes,
                (unsigned)suggested_bytes);

       vTaskDelay(pdMS_TO_TICKS(50));

       // Results of this testing:
       //
       //  ntp_server_task: Stack report: Allocated=16384 bytes, HighWater=14372 bytes unused, PeakUsage=2012 bytes, Suggested=2515 bytes

       */
    }
}

static void update_display_task(void *parameter)
{
    int previous_top_line_message = -1;
    int previous_second = -1;
    int display_uptime_seconds_counter = 0;

    for (;;)
    {
        if (render_ota_display())
        {
            vTaskDelay(pdMS_TO_TICKS(100));
            continue;
        }

        time_t now_utc = time(nullptr);
        struct tm utc_tm{};
        gmtime_r(&now_utc, &utc_tm);

        if (utc_tm.tm_sec != previous_second)
        {
            previous_second = utc_tm.tm_sec;

            if (check_uptime_request())
                display_uptime_seconds_counter = upTimeDisplayWillStayActiveForThisManySeconds;

            sync_state_t sync_snapshot = get_sync_state_snapshot();
            bool sync_fault_active = s_safe_guard_tripped.load() || sync_snapshot.holdover_mode;

            int required_top_line_message = 1;
            if (display_uptime_seconds_counter > 0)
            {
                required_top_line_message = 4;
            }
            else if (sync_fault_active)
            {
                required_top_line_message = 3;
            }
            else if (s_time_setting_in_progress.load())
            {
                required_top_line_message = 2;
            }

            if (required_top_line_message != previous_top_line_message)
            {
                const char *top_line_message = "ESP32 Time Server";
                if (required_top_line_message == 2)
                {
                    top_line_message = "ESP32 Time Server *";
                }
                else if (required_top_line_message == 3)
                {
                    top_line_message = "ESP32 Time Server **";
                }
                else if (required_top_line_message == 4)
                {
                    top_line_message = "ESP32 Time Server's";
                }

                display_line(0, top_line_message);
                previous_top_line_message = required_top_line_message;
            }

            if (display_uptime_seconds_counter > 0)
            {
                char uptime_buffer[lcdColumns + 1];
                char centered[lcdColumns + 1];
                memset(centered, ' ', lcdColumns);
                centered[lcdColumns] = '\0';

                get_uptime(uptime_buffer, sizeof(uptime_buffer));
                size_t uptime_len = strlen(uptime_buffer);
                int left_pad = static_cast<int>((lcdColumns - uptime_len) / 2);
                if (left_pad < 0)
                    left_pad = 0;

                if (uptime_len > lcdColumns)
                    uptime_len = lcdColumns;

                memcpy(centered + left_pad, uptime_buffer, uptime_len);

                display_line(1, "up time is");
                display_line(2, centered);
                display_line(3, " days hrs:mins:secs");
                display_uptime_seconds_counter--;
            }
            else
            {
                char date_line[16];
                char time_line[24];
                format_local_date_time(now_utc, date_line, sizeof(date_line), time_line, sizeof(time_line));
                display_line(1, date_line);
                display_line(2, time_line);
                display_line(3, sync_fault_active ? sync_fault_to_display_text(sync_snapshot.fault) : s_ip_address);
            }
        }

        vTaskDelay(pdMS_TO_TICKS(50));

