roblatour/ESP32TimeServer/main/main.cpp
        /*

        // The following code is used to determine the ideal stack size for this method (update_display_task)
        // it only needs to be setup and run once
        //
        // NOTE 1: The following is required to have the code directly below compile (build):
        //         From the ESP-IDF Terminal enter the command
        //            idf.py menuconfig
        //            (the menu screen may take 30 seconds or more to load)
        //         Navigate to:
        //            Component config → FreeRTOS → Kernel
        //         use the down arrow key to scroll down to
        //            configUSE_TRACE_FACILITY
        //            enable FreeTOS trace facility by pressing the space bar (puts a star in the option [*] to signify it is enabled)
        //         press 'S' (enter) to save the change
        //         press 'Q' to quit
        //         code should now build, flash and run ok
        //
        //         once the ideal stack size is known, the code can below can be commented out and the configUSE_TRACE_FACILITY disabled to save RAM
        //
        // NOTE 2: if in the future this program changes significantly the suggested stack size value generated in this testing may need to be redone
        //
        // Below is the code that has now already been used to calculate the ideal stack size:

        // *** Hard‑coded stack size originally used when creating the task (bytes) ***
        const size_t allocated_bytes = 16384; // <-- set this to the value passed to xTaskCreatePinnedToCore

        // high watermark is returned in words
        UBaseType_t high_watermark_words = uxTaskGetStackHighWaterMark(NULL);
        size_t high_watermark_bytes = (size_t)high_watermark_words * sizeof(StackType_t);

        // compute peak usage and suggested size (25% margin)
        size_t peak_usage_bytes = (allocated_bytes > high_watermark_bytes) ? (allocated_bytes - high_watermark_bytes) : 0;
        size_t suggested_bytes = (size_t)((double)peak_usage_bytes * 1.25);

        ESP_LOGI("update_display_task",
                 "Stack report: Allocated=%u bytes, HighWater=%u bytes unused, PeakUsage=%u bytes, Suggested=%u bytes",
                 (unsigned)allocated_bytes,
                 (unsigned)high_watermark_bytes,
                 (unsigned)peak_usage_bytes,
                 (unsigned)suggested_bytes);

        // Results of this testing:
        //
        //  update_display_task: Stack report: Allocated=16384 bytes, HighWater=14492 bytes unused, PeakUsage=1892 bytes, Suggested=2365 bytes

        */
    }
}

extern "C" void app_main()
{
    setup_pps_input();
    
    initArduino();

    write_opening_messages_to_the_console();

    setup_NVM_storage();

    create_mutexes_and_semaphores();

    initialize_the_display();

    setup_up_time_button();

    setup_ethernet_connection();

    setup_for_ota_updates();

    setup_the_gps();

    xTaskCreatePinnedToCore(ntp_server_task, "ntp_server", 2515, nullptr, 20, nullptr, tskNO_AFFINITY);

    xTaskCreatePinnedToCore(update_display_task, "display_service", 2365, nullptr, 10, nullptr, tskNO_AFFINITY);
}
